{
  "backend/main.mo": "Main Motoko actor for the ICP backend that handles user profiles, contact form submissions, photo/video uploads, and access-controlled admin operations using blob storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting three features: storing 4 book cover images as static assets and updating the 'Books by Our Founder' section on both the Home and About pages to display all 4 books.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short descriptions summarizing each file's purpose and key content for the Manavdeep Seva Trust application.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind directives and defines OKLCH-based CSS custom properties for light and dark color themes including sidebar, chart, and UI component tokens.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app into a root div and loads the TypeScript entry point via a module script tag.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for Home, About, Programs, Donations, Gallery, Contact, and Admin pages under a shared Layout.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Manavdeep Seva Trust branding, quick navigation links, founder/office contact details, copyright, and a Caffeine.ai attribution link.",
  "frontend/src/components/Layout.tsx": "Layout wrapper that renders the Navigation header, a main content Outlet, and the Footer to provide a consistent page structure across all routes.",
  "frontend/src/components/Navigation.tsx": "Sticky responsive navigation bar with the trust logo, desktop and mobile menus for six main links, and a conditionally shown Admin link when the user is authenticated via Internet Identity.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider component and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for backend operations including uploading/deleting photos and videos, fetching all photos/videos, and submitting a contact form via the ICP actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines a warm, earthy CSS custom property color palette for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/About.tsx": "About page component displaying the organization's founder profile, her books, awards, mission, values, and contact information for Manavdeep Seva Trust.",
  "frontend/src/pages/Admin.tsx": "Admin page component that allows authenticated users to upload and delete photos and videos via tabbed forms, with Internet Identity login gating and toast notifications for feedback.",
  "frontend/src/pages/Contact.tsx": "Contact page for Manavdeep Seva Trust displaying contact information (founder, address, phone, email) and a form that submits via the `useContactForm` mutation hook with a success notification.",
  "frontend/src/pages/Donations.tsx": "Donations page showing impact statistics, preset donation amounts with descriptions, and payment method instructions (UPI, bank transfer) for Manavdeep Seva Trust.",
  "frontend/src/pages/Gallery.tsx": "Gallery page with tabbed Photos and Videos sections, combining a static list of 30+ local JPEG assets with dynamically fetched media via `useGetAllPhotos` and `useGetAllVideos` hooks.",
  "frontend/src/pages/Home.tsx": "Home page featuring a hero banner, founder profile (Anjani Dwivedi) with books and awards, and sections highlighting the trust's mission, programs, and calls to action.",
  "frontend/src/pages/Programs.tsx": "Programs page rendering a grid of six initiative cards (Education, Environment, Healthcare, Community Development, Skill Development, Sustainable Agriculture) with icons, descriptions, and detail lists.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH-based color tokens, custom fonts, border radii, box shadows, and animation keyframes, plus plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file (version 51) for a trust/charitable organization website, recording existing features, known issues (founder photo cropping, gallery display), architectural notes, and image replacement requirements."
}