{
  "backend/main.mo": "Main Motoko actor for the backend that handles user profiles, contact form submissions, photo/video uploads with blob storage, and access-controlled admin operations using Internet Identity authentication.",
  "feature_evidence.json": "A feature evidence report JSON file with an empty features array, indicating no features have been documented yet.",
  "frontend-file-summaries.txt": "A JSON file containing one-sentence summaries of all frontend source files, serving as documentation for the frontend codebase structure.",
  "frontend/index.css": "Global CSS file that imports Tailwind directives and defines OKLCH-based CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML entry point titled 'Trust Portal' that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for Home, About, Programs, Donations, Gallery, Contact, and Admin pages under a shared Layout.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Manavdeep Seva Trust branding, quick navigation links, founder/contact details, copyright notice, and a Caffeine.ai attribution link.",
  "frontend/src/components/Layout.tsx": "Layout wrapper that composes the Navigation header, a main content Outlet, and the Footer into a full-height flex column.",
  "frontend/src/components/Navigation.tsx": "Sticky responsive navigation header with the trust logo, desktop and mobile menus for seven routes, and a conditionally rendered Admin link shown only when the user is authenticated via Internet Identity.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP actor using React Query, reinitializing access control with an admin token when the Internet Identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend interactions including contact form submission, photo/video upload, fetching all photos/videos, and deleting photos/videos.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines a warm, earthy CSS custom property color palette for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/About.tsx": "About page displaying the trust's founder profile (Anjani Dwivedi), her books, awards, mission, and organizational values with structured sections.",
  "frontend/src/pages/Admin.tsx": "Admin page requiring Internet Identity authentication, allowing authenticated users to upload and delete photos and videos via tabbed forms.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying organization contact details and a form that submits messages to the backend using the useContactForm mutation hook.",
  "frontend/src/pages/Donations.tsx": "Donations page for Manavdeep Seva Trust displaying a hero section, impact statistics, preset donation amounts with descriptions, and payment method information (UPI, bank transfer, card).",
  "frontend/src/pages/Gallery.tsx": "Gallery page that displays a static list of 30+ activity photos and fetches additional photos/videos via API hooks, rendered in a tabbed interface with loading and empty states.",
  "frontend/src/pages/Home.tsx": "Home page featuring a hero banner, founder profile section with books and awards, and key statistics/mission highlights for the trust.",
  "frontend/src/pages/Programs.tsx": "Programs page listing six trust initiatives (Education, Environment, Healthcare, Community Development, Skill Development, Sustainable Agriculture) in a responsive card grid with icons and detail bullets.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL query parameters (supporting both standard and hash-based routing), persist them in sessionStorage, and clean sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining dark mode, custom color tokens using oklch CSS variables, typography, border radius, box shadows, and keyframe animations. Includes plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the current state of the Manavdeep Seva Trust website project at version 53, listing existing features, known issues (founder photo cropping, gallery display), architectural notes, and flagging it as a fix request."
}