{
  "backend/main.mo": "Main Motoko actor for the trust portal backend, handling user profiles, contact form submissions, photo/video uploads with blob storage, and access-controlled admin operations using Internet Computer's authorization system.",
  "feature_evidence.json": "Feature evidence report confirming the removal of the English subtitle 'Service is the highest duty' from the founder section in Home.tsx, leaving only the Hindi motto text.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, describing each page, component, hook, and config file in the React application.",
  "frontend/index.css": "Root CSS file importing Tailwind directives and defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML entry point titled 'Trust Portal' that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for Home, About, Programs, Donations, Gallery, Contact, and Admin pages under a shared Layout.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Manavdeep Seva Trust branding, quick navigation links, founder/contact details, copyright notice, and a caffeine.ai attribution link with UTM tracking.",
  "frontend/src/components/Layout.tsx": "Layout wrapper that renders the Navigation header, a main content Outlet, and the Footer to provide a consistent page shell.",
  "frontend/src/components/Navigation.tsx": "Sticky responsive navigation bar with the trust logo, desktop and mobile menus for six main routes, and a conditionally rendered Admin link shown only when the user is authenticated via Internet Identity.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing access control with an admin token when an identity is present and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend interactions including contact form submission, photo/video upload, fetching all photos/videos, and deleting photos/videos.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind CSS and defines a warm, earthy CSS custom property color palette for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/About.tsx": "About page component displaying the organization's founder info, history, mission, and values with styled sections and icons.",
  "frontend/src/pages/Admin.tsx": "Admin page that requires Internet Identity authentication and provides UI for uploading/deleting photos and videos via tabbed forms with progress feedback.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying organization contact details and a form for submitting inquiries, using the useContactForm mutation hook with success feedback.",
  "frontend/src/pages/Donations.tsx": "Donations page for Manavdeep Seva Trust displaying impact stats, preset donation amounts with descriptions, and payment method options (UPI, bank transfer, card) with a hero section.",
  "frontend/src/pages/Gallery.tsx": "Gallery page that fetches and displays photos and videos from the API using tabs, showing loading spinners and empty-state placeholders when no media is available.",
  "frontend/src/pages/Home.tsx": "Home page featuring a hero banner, founder profile section, and mission statement for GreenStripe Trust with navigation links to programs and contact pages.",
  "frontend/src/pages/Programs.tsx": "Programs page rendering a grid of six initiative cards (education, environment, healthcare, community, skills, agriculture) with icons, descriptions, and detail bullet points.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL query parameters (supporting both standard and hash-based routing), persist them in sessionStorage, and remove sensitive params from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, defining dark mode, custom color palette using oklch CSS variables, typography, border radius, box shadows, and keyframe animations. Includes plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the current state of the Manavdeep Seva Trust website project at version 25, listing existing features, known issues (founder photo crop), and architectural notes about the admin panel and content management requirements."
}