{
  "backend/main.mo": "Main Motoko actor for the ICP backend that handles user profiles, contact form submissions, photo/video uploads with blob storage, and access-controlled admin operations using authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting completed features, primarily fixes to the Awards & Recognition sections on the About and Home pages to render 7 hardcoded award photos without dynamic src construction.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short descriptions summarizing the purpose and key content of each file in the React frontend.",
  "frontend/index.css": "Global CSS file that imports Tailwind directives and defines OKLCH-based CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with routes for Home, About, Programs, Donations, Gallery, Contact, and Admin pages under a shared Layout.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Manavdeep Seva Trust branding, quick navigation links, founder contact details, and a Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Layout.tsx": "Layout wrapper that renders the Navigation header, a main content Outlet, and the Footer for all pages.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation bar component with desktop and mobile menus, showing links to all main pages and an admin link when the user is authenticated via Internet Identity.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, returning an authenticated actor (with admin token initialization) or an anonymous actor depending on the current identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context and custom hook.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for interacting with the backend actor, covering contact form submission, photo/video upload and deletion, and fetching all photos and videos.",
  "frontend/src/index.css": "Global Tailwind CSS stylesheet defining a warm earthy CSS custom-property color palette for both light and dark modes used throughout the application.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/About.tsx": "About page displaying the trust's founder profile, her books, and sections covering the organization's mission, values, and team.",
  "frontend/src/pages/Admin.tsx": "Admin dashboard page requiring Internet Identity authentication, allowing authenticated users to upload and delete photos and videos using form inputs with progress tracking and toast notifications.",
  "frontend/src/pages/Contact.tsx": "Contact page displaying organization contact information (founder, address, phone) alongside a form that submits messages via a React Query mutation with success feedback.",
  "frontend/src/pages/Donations.tsx": "Donations page for Manavdeep Seva Trust showing impact statistics, preset donation amounts with descriptions, and payment method information (UPI, bank transfer).",
  "frontend/src/pages/Gallery.tsx": "Gallery page displaying a tabbed view of photos and videos, combining a large set of static local image assets with dynamically fetched photos and videos from backend queries.",
  "frontend/src/pages/Home.tsx": "Home landing page for Manavdeep Seva Trust featuring a hero banner, founder profile with biography and book covers, and sections highlighting the organization's mission and programs.",
  "frontend/src/pages/Programs.tsx": "Displays a Programs page for a charitable organization with a hero section and a grid of six program cards (Education, Environment, Healthcare, Community, Skills, Agriculture), each with an icon, description, and detail list.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting URL parameters from both regular query strings and hash-based routing, with helpers for persisting values to/from sessionStorage and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the frontend, extending the default theme with custom fonts, OKLCH-based color tokens (including trust, nature, chart, and sidebar palettes), border radii, box shadows, and animation keyframes, with typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state (version 65) for the Manavdeep Seva Trust website, listing implemented features, known issues (founder photo cropping, award photos not displaying), architectural notes, and fix request flags."
}