{
  "kind": "build_request",
  "title": "Add 'Teacher, Writer and Social Worker' roles to founder description",
  "projectName": "Manavdeep Seva Trust",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-52",
      "text": "Update the founder description on the About page (frontend/src/pages/About.tsx) to include the roles 'Teacher, Writer and Social Worker' as a subtitle or descriptor line beneath the founder's name 'Anjani Dwivedi (Kavya)'.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Teacher,Writer and Social worker"
        ]
      },
      "acceptanceCriteria": [
        "The text 'Teacher, Writer and Social Worker' appears on the About page beneath or alongside the founder's name 'Anjani Dwivedi (Kavya)'.",
        "The roles text is styled consistently with the existing About page design (e.g., as a subtitle, badge, or secondary text).",
        "No other content on the About page is removed or rearranged."
      ]
    },
    {
      "id": "REQ-53",
      "text": "Update the founder section on the Home page (frontend/src/pages/Home.tsx) to include the roles 'Teacher, Writer and Social Worker' as a subtitle or descriptor beneath the founder's name 'Anjani Dwivedi (Kavya)'.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Teacher,Writer and Social worker"
        ]
      },
      "acceptanceCriteria": [
        "The text 'Teacher, Writer and Social Worker' appears in the founder section on the Home page beneath or alongside the founder's name.",
        "The roles text is styled consistently with the existing founder section design.",
        "The founder photo, motto text 'मानव सेवा परमो धर्मः', and other existing elements remain unchanged."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/ or frontend/src/components/ui/.",
    "Do not alter the founder photo display, motto text, or any other existing content on the Home or About pages beyond adding the roles descriptor."
  ],
  "nonGoals": [
    "Adding new pages or routes.",
    "Changing backend logic or data models.",
    "Modifying gallery, donations, contact, or any other pages."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}