{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add 'Teacher, Writer and Social Worker' roles to founder description",
  "requirements": [
    {
      "id": "REQ-52",
      "summary": "Update the founder description on the About page to include the roles 'Teacher, Writer and Social Worker' as a subtitle beneath the founder's name 'Anjani Dwivedi (Kavya)'.",
      "acceptanceCriteria": [
        "The text 'Teacher, Writer and Social Worker' appears on the About page beneath or alongside the founder's name 'Anjani Dwivedi (Kavya)'.",
        "The roles text is styled consistently with the existing About page design (e.g., as a subtitle, badge, or secondary text).",
        "No other content on the About page is removed or rearranged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/About.tsx",
          "operation": "modify",
          "description": "Add the text 'Teacher, Writer and Social Worker' as a subtitle or descriptor line beneath the founder's name 'Anjani Dwivedi (Kavya)' in the founder section. Style the roles text consistently with the existing About page design using appropriate text styling classes (e.g., text-muted-foreground, italic, or a smaller font size). Ensure no other content in the About page is removed or rearranged."
        }
      ]
    },
    {
      "id": "REQ-53",
      "summary": "Update the founder section on the Home page to include the roles 'Teacher, Writer and Social Worker' as a subtitle beneath the founder's name 'Anjani Dwivedi (Kavya)'.",
      "acceptanceCriteria": [
        "The text 'Teacher, Writer and Social Worker' appears in the founder section on the Home page beneath or alongside the founder's name.",
        "The roles text is styled consistently with the existing founder section design.",
        "The founder photo, motto text 'मानव सेवा परमो धर्मः', and other existing elements remain unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Home.tsx",
          "operation": "modify",
          "description": "Add the text 'Teacher, Writer and Social Worker' as a subtitle or descriptor line beneath the founder's name 'Anjani Dwivedi (Kavya)' in the founder profile section. Style the roles text consistently with the existing founder section design using appropriate text styling classes. Ensure the founder photo, motto text 'मानव सेवा परमो धर्मः', and all other existing elements remain unchanged."
        }
      ]
    }
  ]
}