{
  "backend/main.mo": "Motoko actor defining contact form backend with functions to submit messages, retrieve contact info (address, phone, email), and fetch all messages sorted by name.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: removal of Leadership Team section from About page and removal of placeholder photos and videos from Gallery page.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of all frontend source files including pages, components, hooks, and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining OKLCH color palette for light and dark modes with warm, earthy tones suitable for a charitable trust website.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Trust Portal application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with six routes (Home, About, Programs, Donations, Gallery, Contact) wrapped in Layout component.",
  "frontend/src/components/Footer.tsx": "Footer component displaying trust information, quick navigation links, contact details (Anjani Dwivedi, Deoria office, phone 9651044109), copyright notice, and Caffeine.ai attribution.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component providing consistent Navigation header and Footer structure with Outlet for page content rendering.",
  "frontend/src/components/Navigation.tsx": "Responsive navigation header with Manavdeep Seva Trust logo, desktop menu with six links, mobile hamburger menu, and active route highlighting.",
  "frontend/src/hooks/useActor.ts": "React Query hook managing backend actor creation with Internet Identity authentication, handling anonymous and authenticated actors with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query mutation hook for submitting contact form data to backend actor with automatic cache invalidation on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, earthy color palette (browns, beiges, terracotta) for light and dark modes, including trust and nature accent colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/src/pages/About.tsx": "About page displaying founder information (Anjani Dwivedi/Kavya with contact 9651044109), organization history starting from 2015, and mission/values sections with icon-decorated cards.",
  "frontend/src/pages/Contact.tsx": "Contact page with a form submission handler using useContactForm hook, displaying founder contact details, office address in Deoria (Uttar Pradesh), and contact information with success notification.",
  "frontend/src/pages/Donations.tsx": "Donations page showcasing impact statistics (5000+ lives, 50+ projects), suggested donation amounts with impact descriptions, and payment method information for supporting Manavdeep Seva Trust.",
  "frontend/src/pages/Gallery.tsx": "Gallery page with tabbed interface for photos and videos, currently showing placeholder empty states with icons indicating no content is available yet.",
  "frontend/src/pages/Home.tsx": "Homepage featuring hero section with GreenStripe Trust branding, mission statement about community empowerment and sustainability, and three key highlight cards for Community Support, environmental work, and programs.",
  "frontend/src/pages/Programs.tsx": "React component displaying a Programs page with a hero section and a grid of six program cards (Education, Environment, Healthcare, Community Development, Skill Development, Sustainable Agriculture), each with icons, descriptions, and color-coded styling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with semantic tokens (primary, nature, trust, etc.), custom fonts (Inter, Georgia), container settings, border radius variables, and animation keyframes.",
  "project_state.json": "Project state tracking file documenting completed features for a charitable trust website including homepage, about page, programs page, contact page, navigation, footer, design theme, logo integration, and founder information display."
}